src/cf/Catalogs/КонтрольПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтрольПродаж</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключенВРМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехТорговыхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсейНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палитра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппыТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаполненияПалитрыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодпискаНаНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПодписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПалитрыКонтроляПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Палитра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКонтроля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтроля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДниНеделиРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапретПодбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретВидаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретРучнойСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСотрудникомНаКСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитКоличестваВСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитКоличестваСтрокВЧеке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитСуммыВЧеке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтроля</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПредупреждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПараметрыКонтроляПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/КонтрольПродаж/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Значение "Вида контроля" в строке табличной части, которое было до выбора нового.
&НаКлиенте
Перем ПредыдущийВидКонтроля;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Локальный = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	ПрочитатьЗначениеИспользования();
	НастроитьДоступностьФормы();
	ЗаполнитьТипыКонтроля();
	Элементы.ОписаниеПодписки.Видимость = Объект.ПодпискаНаНоменклатуру;
	Если Объект.Локальный Тогда
		ОбщегоНазначенияРМК.НастроитьДоступныеСпособыЗаполненияНоменклатурыКонтроляПродаж(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступностьЭлементовФормы();
	НастроитьДоступностьОтборовПоНоменклатуре();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если КонтрольПродажЗаполненКорректно() Тогда
		Если Объект.Локальный Тогда
			ТекущийОбъект.Использование = ИспользованиеЛокально;
		ИначеЕсли Объект.Использование Тогда
			ТекущийОбъект.ВключенВРМК = ИспользованиеЛокально;
		КонецЕсли;
		АктуализироватьСписокПалитр(ТекущийОбъект);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДляВсехТорговыхОбъектовПриИзменении(Элемент)
	
	Если Объект.ДляВсехТорговыхОбъектов И Объект.ТорговыеОбъекты.Количество() > 0 Тогда
		ПодтвердитьОчисткуМагазиновПриВключенииПризнака();
	Иначе
		НастроитьДоступностьТаблицыМагазинов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДляВсейНоменклатурыПриИзменении(Элемент)
	
	Если Объект.ДляВсейНоменклатуры И (Объект.Номенклатура.Количество() > 0 Или ЗначениеЗаполнено(Объект.Палитра)) Тогда
		ПодтвердитьОчисткуСпискаТоваровПриВключенииПризнака();
	Иначе
		НастроитьДоступностьТаблицыНоменклатуры();
		НастроитьДоступностьПалитры();
		НастроитьДоступностьПечатиСоставаПалитры();
		АктуализироватьПодпискуНаИзменениеНоменклатуры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраПриИзменении(Элемент)
	
	НастроитьДоступностьТаблицыНоменклатуры();
	НастроитьДоступностьПечатиСоставаПалитры();
	АктуализироватьПодпискуНаИзменениеНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НастроитьДоступностьПалитры();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыКонтрольПродаж

&НаКлиенте
Процедура КонтрольПродажПриАктивизацииСтроки(Элемент)
	
	НастроитьДоступностьПолейВремени();
	ЗапомнитьТекущийВидКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПродажВидКонтроляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		УстановитьТипКонтроляВСтроке(ТекущиеДанные);
		ОбработатьИзменениеВидаКонтроля(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПродажПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		НастроитьДоступностьПолейВремени();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПродажВидКонтроляНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Объект.КонтрольПродаж.Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
		СостояниеКонтроля = ПолучитьСостояниеКонтроляПродаж(ТекущиеДанные);
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ВыборВидаКонтроляЗавершение", ЭтотОбъект);
		ПараметрыОткрытияФормы = Новый Структура("СостояниеКонтроля", СостояниеКонтроля);
		ОткрытьФорму("Справочник.ВидыКонтроля.Форма.ФормаВыбора", ПараметрыОткрытияФормы, ЭтотОбъект,,,,
			ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПослеУдаления(Элемент)
	
	НастроитьДоступностьОтборовПоНоменклатуре();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуПодбораНоменклатуры(Команда)
	
	ЗаголовокФормыПодбора = СтрШаблон(НСтр("ru = 'Подбор товаров в контроль продаж %1'"),
			?(ЗначениеЗаполнено(Объект.Ссылка),
				Объект.Ссылка,
				НСтр("ru = ''")));
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ЗавершениеОбработкиПодбораТоваров", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок", ЗаголовокФормыПодбора);
	ПараметрыОткрытия.Вставить("КлючУникальности", УникальныйИдентификатор);
	ОбщегоНазначенияРМККлиент.ЗаполнитьПараметрыОткрытияФормыПодбораНоменклатурыКонтроляПродаж(ПараметрыОткрытия);
	ОбщегоНазначенияРМККлиент.ОткрытьИнтерфейсПодбораНоменклатуры(ЭтотОбъект, ПараметрыОткрытия, ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСоставПалитры(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Палитра", Объект.Палитра);
	ПараметрыОткрытия.Вставить("ВариантОтчета", "Основной");
	
	ОткрытьФорму("Отчет.СоставПалитры.Форма.ФормаОтчета", ПараметрыОткрытия, ЭтотОбъект,
		ЭтотОбъект.УникальныйИдентификатор, , , Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьНоменклатуру(Команда)
	
	ОбщегоНазначенияРМККлиентПереопределяемый.ЗаполнитьНоменклатуруВКонтролеПродаж(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборВидаКонтроляЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
		Если Не ТекущиеДанные = Неопределено Тогда
			
			ТекущиеДанные.ВидКонтроля = Результат;
			УстановитьТипКонтроляВСтроке(ТекущиеДанные);
			ОбработатьИзменениеВидаКонтроля(ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВидаКонтроля(ТекущиеДанные)
	
	ТипыКонтроляНаЧек = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыКонтроляНаЧек();
	ПродолжитьОбработку = Истина;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидКонтроля) Тогда
		
		ТекстОшибки = "";
		Если ВидКонтроляСодержитНеСовместимыйТип(ТекущиеДанные, ТекстОшибки) Тогда
			ВернутьПредыдущийВидКонтроля(ПредыдущийВидКонтроля, ТекущиеДанные);
			ПродолжитьОбработку = Ложь;
			ПоказатьПредупреждение(Неопределено, ТекстОшибки);
		ИначеЕсли УстановленОтборНоменклатуры() И Не ТипыКонтроляНаЧек.Найти(ТекущиеДанные.ТипКонтроля) = Неопределено Тогда
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
			ДополнительныеПараметры.Вставить("ПредыдущееЗначение", ПредыдущийВидКонтроля);
			ТекстВопроса = НСтр("ru='Для видов контроля на весь чек отборы по номенклатуре не доступны.
				|Список номенклатуры, палитра и признак ""для всей номенклатуры"" будут очищены. Продолжить?'");
			ОповещениеОбОтвете = Новый ОписаниеОповещения("ОбработатьОтветОчисткиОтбораНоменклатуры",
				ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(ОповещениеОбОтвете, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			ПродолжитьОбработку = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	Если ПродолжитьОбработку Тогда
		ЗафиксироватьИзмененияВидаКонтроля(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветОчисткиОтбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	ИсходнаяСтрока = Объект.КонтрольПродаж.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если Результат = КодВозвратаДиалога.Да Тогда
		СброситьОтборНоменклатуры();
		ЗафиксироватьИзмененияВидаКонтроля(ИсходнаяСтрока);
	Иначе
		ВернутьПредыдущийВидКонтроля(ДополнительныеПараметры.ПредыдущееЗначение, ИсходнаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьИзмененияВидаКонтроля(СтрокаКонтроля)
	
	ПредыдущийВидКонтроля = СтрокаКонтроля.ВидКонтроля;
	НастроитьДоступностьОтборовПоНоменклатуре();
	НастроитьДоступностьПолейВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьПредыдущийВидКонтроля(ПредыдущееЗначение, СтрокаКонтроля)
	
	СтрокаКонтроля.ВидКонтроля = ПредыдущееЗначение;
	ПредыдущийВидКонтроля = ПредыдущееЗначение;
	Элементы.КонтрольПродаж.ТекущаяСтрока = Объект.КонтрольПродаж.Индекс(СтрокаКонтроля);
	УстановитьТипКонтроляВСтроке(СтрокаКонтроля);
	
КонецПроцедуры

&НаКлиенте
Функция ВидКонтроляСодержитНеСовместимыйТип(ТекущиеДанные, ТекстОшибки)
	
	РезультатФункции = Ложь;
	
	ТипыКонтроляНаЧек = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыКонтроляНаЧек();
	ЭтоПроверкаСтроки = (ТипыКонтроляНаЧек.Найти(ТекущиеДанные.ТипКонтроля) = Неопределено);
	СостояниеКонтроля = ПолучитьСостояниеКонтроляПродаж(ТекущиеДанные);
	Если СостояниеКонтроля.ЕстьПроверкиНаЧек И ЭтоПроверкаСтроки Тогда
		
		РезультатФункции = Истина;
		ТекстОшибки = НСтр("ru='Нельзя выбрать вид контроля, относящийся к строке чека.
			|В списке уже есть виды контроля на весь чек.
			|Создайте отдельный элемент контроля продаж'");
		
	ИначеЕсли СостояниеКонтроля.ЕстьПроверкиНаСтроку И Не ЭтоПроверкаСтроки Тогда
		
		РезультатФункции = Истина;
		ТекстОшибки = НСтр("ru='Нельзя выбрать вид контроля, относящийся ко всему чеку.
			|В списке уже есть виды контроля на строки чека.
			|Создайте отдельный элемент контроля продаж'");
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция УстановленОтборНоменклатуры()
	
	Возврат (Объект.Номенклатура.Количество() > 0 Или ЗначениеЗаполнено(Объект.Палитра) Или Объект.ДляВсейНоменклатуры);
	
КонецФункции

&НаКлиенте
Процедура СброситьОтборНоменклатуры()
	
	Объект.Палитра = Неопределено;
	Объект.ДляВсейНоменклатуры = Ложь;
	Объект.Номенклатура.Очистить();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСостояниеКонтроляПродаж(СтрокаИсключения = Неопределено)
	
	ТипыКонтроляНаЧек = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыКонтроляНаЧек();
	
	ЕстьПроверкиНаЧек = Ложь;
	ЕстьПроверкиНаСтроку = Ложь;
	
	КоличествоСтрок = Объект.КонтрольПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И Не (ЕстьПроверкиНаЧек И ЕстьПроверкиНаСтроку) Цикл
		СтрокаКонтроля = Объект.КонтрольПродаж.Получить(ИндексСтроки);
		Если Не СтрокаКонтроля = СтрокаИсключения Тогда
			
			ЗаполнитьПризнакиТипаКонтроля(ТипыКонтроляНаЧек, СтрокаКонтроля.ТипКонтроля,
				ЕстьПроверкиНаЧек, ЕстьПроверкиНаСтроку);
			
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат Новый Структура("ЕстьПроверкиНаЧек,ЕстьПроверкиНаСтроку", ЕстьПроверкиНаЧек, ЕстьПроверкиНаСтроку);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПризнакиТипаКонтроля(ТипыКонтроляНаЧек, ТипКонтроля, ЕстьПроверкиНаЧек, ЕстьПроверкиНаСтроку)
	
	Если ЗначениеЗаполнено(ТипКонтроля) Тогда
		Если ТипыКонтроляНаЧек.Найти(ТипКонтроля) = Неопределено Тогда
			Если Не ЕстьПроверкиНаСтроку Тогда
				ЕстьПроверкиНаСтроку = Истина;
			КонецЕсли;
		Иначе
			Если Не ЕстьПроверкиНаЧек Тогда
				ЕстьПроверкиНаЧек = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьТекущийВидКонтроля()
	
	ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ПредыдущийВидКонтроля = ТекущиеДанные.ВидКонтроля;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗначениеИспользования()
	
	Если АвтономнаяЛогикаИспользования Тогда
		ИспользованиеЛокально = (Объект.Использование И (Объект.ВключенВРМК Или Объект.Локальный));
		Элементы.ИспользованиеЛокально.Доступность = (Объект.Использование Или Объект.Локальный);
	Иначе
		ИспользованиеЛокально = Объект.Использование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьТипКонтроляНаЧек()
	
	РезультатФункции = Ложь;
	
	ТипыКонтроляНаЧек = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыКонтроляНаЧек();
	КоличествоСтрок = Объект.КонтрольПродаж.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
		СтрокаКонтроля = Объект.КонтрольПродаж.Получить(ИндексСтроки);
		Если Не ТипыКонтроляНаЧек.Найти(СтрокаКонтроля.ТипКонтроля) = Неопределено Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура НастроитьДоступностьОтборовПоНоменклатуре()
	
	Если ЕстьТипКонтроляНаЧек() Тогда
		Если Элементы.СтраницаНоменклатура.Доступность Тогда
			Элементы.СтраницаНоменклатура.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли Не Элементы.СтраницаНоменклатура.Доступность Тогда
		Элементы.СтраницаНоменклатура.Доступность = Истина;
		Элементы.Палитра.Доступность = Истина;
		Элементы.Номенклатура.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЭлементовФормы()
	
	НастроитьДоступностьТаблицыМагазинов();
	НастроитьДоступностьТаблицыНоменклатуры();
	НастроитьДоступностьПалитры();
	НастроитьДоступностьПечатиСоставаПалитры();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьТаблицыМагазинов()
	
	Элементы.СтраницаМагазины.Доступность = Не Объект.ДляВсехТорговыхОбъектов;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьТаблицыНоменклатуры()
	
	Элементы.Номенклатура.Доступность = Не (Объект.ДляВсейНоменклатуры Или ЗначениеЗаполнено(Объект.Палитра));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьПалитры()
	
	Элементы.Палитра.Доступность = Не (Объект.ДляВсейНоменклатуры Или Объект.Номенклатура.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОчисткуМагазиновПриВключенииПризнака()
	
	ПараметрыОповещения = Новый Структура("УстановкаПризнака", Истина);
	ОповещениеОтвета = Новый ОписаниеОповещения("ОбработкаОтветаОчисткиМагазинов", ЭтотОбъект, ПараметрыОповещения);
	ТекстВопроса = НСтр("ru = 'Список магазинов будет очищен. Продолжить?'");
	ПоказатьВопрос(ОповещениеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОчисткиМагазинов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТорговыеОбъекты.Очистить();
		НастроитьДоступностьТаблицыМагазинов();
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("УстановкаПризнака")
			И ДополнительныеПараметры.УстановкаПризнака Тогда
		Объект.ДляВсехТорговыхОбъектов = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОчисткуСпискаТоваровПриВключенииПризнака()
	
	ПараметрыОповещения = Новый Структура("УстановкаПризнака", Истина);
	ОповещениеОтвета = Новый ОписаниеОповещения("ОбработкаОтветаОчисткиСпискаТоваров", ЭтотОбъект, ПараметрыОповещения);
	ТекстВопроса = НСтр("ru = 'Список товаров будет очищен. Продолжить?'");
	ПоказатьВопрос(ОповещениеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОчисткиСпискаТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Объект.Номенклатура.Количество() > 0 Тогда
			Объект.Номенклатура.Очистить();
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Палитра) Тогда
			Объект.Палитра = Неопределено;
		КонецЕсли;
		НастроитьДоступностьТаблицыНоменклатуры();
		НастроитьДоступностьПалитры();
		НастроитьДоступностьПечатиСоставаПалитры();
		АктуализироватьПодпискуНаИзменениеНоменклатуры();
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("УстановкаПризнака")
			И ДополнительныеПараметры.УстановкаПризнака Тогда
		Объект.ДляВсейНоменклатуры = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьСписокПалитр(ТекущийОбъект)
	
	ТекущийОбъект.ПалитрыКонтроляПродаж.Очистить();
	Если ЗначениеЗаполнено(Объект.Палитра) Тогда
		ИсходныйМассив = Новый Массив;
		ИсходныйМассив.Добавить(Объект.Палитра);
		ПодчиненныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(ИсходныйМассив);
		НоваяСтрока = ТекущийОбъект.ПалитрыКонтроляПродаж.Добавить();
		НоваяСтрока.Палитра = Объект.Палитра;
		Для Каждого ЭлементПалитра Из ПодчиненныеПалитры Цикл
			НоваяСтрока = ТекущийОбъект.ПалитрыКонтроляПродаж.Добавить();
			НоваяСтрока.Палитра = ЭлементПалитра;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонтрольПродажЗаполненКорректно()
	
	РезультатФункции = Истина;
	
	КоличествоСтрокКонтроля = Объект.КонтрольПродаж.Количество();
	ИндексКонтроля = 0;
	Пока ИндексКонтроля < КоличествоСтрокКонтроля И РезультатФункции Цикл
		СтрокаКонтроля = Объект.КонтрольПродаж.Получить(ИндексКонтроля);
		ТекстОшибки = "";
		ИмяКолонки = "";
		Если ЗначениеЗаполнено(СтрокаКонтроля.КонецПериода)
				И СтрокаКонтроля.НачалоПериода > СтрокаКонтроля.КонецПериода Тогда
				
			ТекстОшибки = НСтр("ru = 'Конец периода не может быть меньше начала периода.'");
			ИмяКолонки = "КонецПериода";
			РезультатФункции = Ложь;
			
		ИначеЕсли СтрокаКонтроля.ВремяНачала > СтрокаКонтроля.ВремяОкончания Тогда
			
			ТекстОшибки = НСтр("ru = 'Время начала не может быть больше времени окончания.'");
			ИмяКолонки = "ВремяНачала";
			РезультатФункции = Ложь;
			
		КонецЕсли;
		Если Не РезультатФункции Тогда
			ЧастьТекстаНомерСтроки = НСтр("ru = 'Неверно заполнена строка №'");
			ТекстНомераСтроки = СтрШаблон("%1 %2.", ЧастьТекстаНомерСтроки, Формат(ИндексКонтроля + 1, "ЧГ="));
			ТекстСообщения = СтрШаблон("%1%2%3", ТекстНомераСтроки, Символы.ПС, ТекстОшибки);
			ПолеОтображенияОшибки = СтрШаблон("Объект.КонтрольПродаж[%1].%2", Формат(ИндексКонтроля, "ЧГ="), ИмяКолонки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПолеОтображенияОшибки);
		КонецЕсли;
		
		ИндексКонтроля = ИндексКонтроля + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура НастроитьДоступностьФормы()
	
	ТолькоДляПросмотра = Не Объект.Локальный;
	Элементы.Наименование.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.Описание.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.ДляВсехТорговыхОбъектов.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.ДляВсейНоменклатуры.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.Палитра.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.КонтрольПродаж.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.ТорговыеОбъекты.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.Номенклатура.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.НаименованиеГруппыТоваров.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.НоменклатураОткрытьФормуПодбораНоменклатуры.Доступность = Не ТолькоДляПросмотра;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения")
			И ИсточникВыбора.ИмяФормы = "Справочник.ВидыКонтроля.Форма.ФормаВыбора" Тогда
			
		Возврат;
			
	КонецЕсли;
	
	Для Каждого ЗначениеНоменклатуры Из ВыбранноеЗначение Цикл
		
		ОтборНоменклатуры = Новый Структура("Номенклатура", ЗначениеНоменклатуры);
		СуществующиеСтроки = Объект.Номенклатура.НайтиСтроки(ОтборНоменклатуры);
		Если СуществующиеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Номенклатура.Добавить();
			НоваяСтрока.Номенклатура = ЗначениеНоменклатуры;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКонтроля()
	
	ИспользуемыеВидыКонтроля = Новый Массив;
	Для Каждого СтрокаКонтроля Из Объект.КонтрольПродаж Цикл
		
		Если ЗначениеЗаполнено(СтрокаКонтроля.ВидКонтроля)
				И ИспользуемыеВидыКонтроля.Найти(СтрокаКонтроля.ВидКонтроля) = Неопределено Тогда
				
			ИспользуемыеВидыКонтроля.Добавить(СтрокаКонтроля.ВидКонтроля);
			
		КонецЕсли;
		
	КонецЦикла;
	ТипыВидовКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ИспользуемыеВидыКонтроля, "ТипКонтроля");
	Для Каждого СтрокаКонтроля Из Объект.КонтрольПродаж Цикл
		Если ЗначениеЗаполнено(СтрокаКонтроля.ВидКонтроля) Тогда
			СтрокаКонтроля.ТипКонтроля = ТипыВидовКонтроля[СтрокаКонтроля.ВидКонтроля];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипКонтроляВСтроке(ТекущиеДанные)
	
	ТипКонтроляСтроки = Неопределено;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидКонтроля) Тогда
		ТипКонтроляСтроки = ПолучитьТипКонтроляПоВидуКонтроля(ТекущиеДанные.ВидКонтроля);
	КонецЕсли;
	ТекущиеДанные.ТипКонтроля = ТипКонтроляСтроки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипКонтроляПоВидуКонтроля(ВидКонтроля)
	
	РезультатФункции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКонтроля, "ТипКонтроля");
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ТипКонтроляПоддерживаетВремя(ТипКонтроля)
	
	ТипСОграничениемВремени = Новый Массив;
	ТипСОграничениемВремени.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретПодбора"));
	ТипСОграничениемВремени.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя"));
	ТипСОграничениемВремени.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольСотрудникомНаКСО"));
	ТипСОграничениемВремени.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке"));
	ТипСОграничениемВремени.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке"));
	ТипСОграничениемВремени.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке"));
	
	РезультатФункции = Ложь;
	
	Если Не ТипСОграничениемВремени.Найти(ТипКонтроля) = Неопределено Тогда
			
		РезультатФункции = Истина;
			
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура НастроитьДоступностьПолейВремени()
	
	ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
	Если Не (ТекущиеДанные = Неопределено Или ЭтотОбъект.ТолькоПросмотр) Тогда
		ТолькоПросмотрВремени = Истина;
		Если ТипКонтроляПоддерживаетВремя(ТекущиеДанные.ТипКонтроля) Тогда
			
			ТолькоПросмотрВремени = Ложь;
			
		Иначе
			
			ТекущиеДанные.ВремяНачала = Дата(1, 1, 1, 0, 0, 0);
			ТекущиеДанные.ВремяОкончания = Дата(1, 1, 1, 0, 0, 0);
			
		КонецЕсли;
		Элементы.КонтрольПродажВремяНачала.ТолькоПросмотр = ТолькоПросмотрВремени;
		Элементы.КонтрольПродажВремяОкончания.ТолькоПросмотр = ТолькоПросмотрВремени;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьПечатиСоставаПалитры()
	
	Элементы.ОткрытьОтчетСоставПалитры.Доступность = ЗначениеЗаполнено(Объект.Палитра);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьВыборНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		
		ВыполнитьДобавлениеПоЗаполнению(Результат);
		ОбщегоНазначенияРМККлиентПереопределяемый.ОбработатьЗавершениеЗаполненияНоменклатурыВПалитре(ЭтотОбъект, 
			Результат, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДобавлениеПоЗаполнению(Результат)
	
	ДанныеВыбора = ОбработатьПодборНаСервере(Результат);
	
	Если НЕ ДанныеВыбора = Неопределено Тогда
		
		Элементы.Номенклатура.ТекущаяСтрока = ДанныеВыбора.ИдентификаторПоследнегоВыбранногоЭлемента;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПодборНаСервере(ВыбранноеЗначение)
	
	Результат = Неопределено;
	Позиции = ЗначенияПодбора(ВыбранноеЗначение);
	Если Позиции.Количество() > 0 Тогда
		Результат = Новый Структура();
		Для Каждого Позиция Из Позиции Цикл
		
			НовыйЭлемент = Объект.Номенклатура.Добавить();
			НовыйЭлемент.Номенклатура = Позиция.Номенклатура;
		
		КонецЦикла;
		Результат.Вставить("ИдентификаторПоследнегоВыбранногоЭлемента", НовыйЭлемент.ПолучитьИдентификатор());
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначенияПодбора(ИсходныеДанные)

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура");
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьЗначенияПодбораДляПалитры(ИсходныеДанные, Результат);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура АктуализироватьПодпискуНаИзменениеНоменклатуры()
	
	Если Объект.ПодпискаНаНоменклатуру И (Объект.ДляВсейНоменклатуры Или ЗначениеЗаполнено(Объект.Палитра)) Тогда
		Объект.ПодпискаНаНоменклатуру = Ложь;
		Объект.ИсточникЗаполнения = Неопределено;
		Объект.ОписаниеПодписки = "";
		Элементы.ОписаниеПодписки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбработкиПодбораТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ВыполнитьДобавлениеПоЗаполнению(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
